CSI API ETABS v1
cDatabaseTables.GetTableForEditingArray Method
 Returns a single table in a string array for interactive editing.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTableForEditingArray(
	string TableKey,
	string GroupName,
	ref int TableVersion,
	ref string[] FieldsKeysIncluded,
	ref int NumberRecords,
	ref string[] TableData
)
Function GetTableForEditingArray (
	TableKey As String,
	GroupName As String,
	ByRef TableVersion As Integer,
	ByRef FieldsKeysIncluded As String(),
	ByRef NumberRecords As Integer,
	ByRef TableData As String()
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim GroupName As String
Dim TableVersion As Integer
Dim FieldsKeysIncluded As String()
Dim NumberRecords As Integer
Dim TableData As String()
Dim returnValue As Integer
returnValue = instance.GetTableForEditingArray(TableKey,
	GroupName, TableVersion, FieldsKeysIncluded,
	NumberRecords, TableData)
int GetTableForEditingArray(
	String^ TableKey,
	String^ GroupName,
	int% TableVersion,
	array<String^>^% FieldsKeysIncluded,
	int% NumberRecords,
	array<String^>^% TableData
)
abstract GetTableForEditingArray :
        TableKey : string *
        GroupName : string *
        TableVersion : int byref *
        FieldsKeysIncluded : string[] byref *
        NumberRecords : int byref *
        TableData : string[] byref -> int
Parameters
TableKey
Type: System.String
Input Item: The table key for a table which will be interactively edited. The table must be one that can be interactively edited.
GroupName
Type: System.String
 Input Item: IMPORTANT NOTE: This parameter is not active in this release.
 The name of a group for which data will be returned.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
FieldsKeysIncluded
Type: System.String[]
 Returned Item: A zero-based array listing the field keys associated with the specified table for which data is reported in the order it is reported in the TableData array. These are essentially the column headers of the data returned in TableData.
NumberRecords
Type: System.Int32
Returned Item: The number of records of data returned for each field. This is essentially the number of rows of data.
TableData
Type: System.String[]
Returned Item: A zero-based, one-dimensional array of the table data, excluding headers, returned row by row. The format of the data is explained below.
 As an example, suppose there are three fields in the FieldsKeysIncluded array and the NumberRecords is five.
EXAMPLE Material Name | Type | Density
A992Fy50 | Steel | 490
4000Psi | Concrete | 150
A615Gr60 | Rebar | 480
A416Gr270 | Tendon | 470
6061T6 | Aluminum | 170
 The data is returned row by row, and items 0 thru 2 in this array would be the first row, items 3 thru 5 the second row, etc, and items 12 thru 14 the fifth row. Using the example of the table above, the returned array would look like this: {A992Fy50, Steel, 490, 4000Psi, Concrete, 150, A615Gr60, Rebar, 480, A416Gr270, Tendon, 470, 6061T6, Aluminum, 170}
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace